index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Fukaya Categories of Surfaces, Math 595 FSC, Fall 2022</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" title="Standard" href="css/worg.css" type="text/css">
<link rel="alternate stylesheet" title="Zenburn" href="css/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="css/worg-classic.css" type="text/css" />
<link rel="shortcut icon" href="https://math.illinois.edu/themes/custom/las_unit_theme/favicon-32x32.png" type="image/png" />
</head>
<body>
<main id="content">
<header>
<h1 class="title">Fukaya Categories of Surfaces, Math 595 FSC, Fall 2022</h1>
</header>
<section id="outline-container-org40a0dde" class="outline-2">
<h2 id="org40a0dde">Basic information</h2>
<div class="outline-text-2" id="text-org40a0dde">
<ul class="org-ul">
<li><b>Lectures:</b> MWF 11:00&#x2013;11:50am in 441 Altgeld Hall.</li>

<li><b>Instructor:</b> <a href="http://pascaleff.com">James Pascaleff</a>
<ul class="org-ul">
<li><b>Email:</b> <a href="mailto:jpascale@illinois.edu">jpascale@illinois.edu</a>; <b>Office:</b> 357 Altgeld Hall; <b>Phone:</b> (217) 244-7277.</li>
<li><b>Office hours:</b> TBD.</li>
</ul></li>

<li><b>Course website:</b> <a href="https://pascaleff.github.io/595fa22/">https://pascaleff.github.io/595fa22/</a></li>
</ul>
</div>
</section>

<section id="outline-container-org2c5646a" class="outline-2">
<h2 id="org2c5646a">Course description</h2>
<div class="outline-text-2" id="text-org2c5646a">
<p>
The Fukaya category is a sophisticated invariant of symplectic
manifolds whose definition in full generality is intricate. In the
original formulation, objects of this category are certain &ldquo;branes&rdquo;
supported on Lagrangian submanifolds, and the composition laws in
the category involve pseudo-holomorphic maps with Lagrangian
boundary conditions (Floer theory).
</p>

<p>
At the same time, a category, like any other algebraic structure,
can admit many presentations. For instance, we could try to find a
presentation of the Fukaya category by generators and relations, or
we could try to build the Fukaya category of a symplectic manifold
up from categories associated to smaller pieces of the manifold.
</p>

<p>
Let \(S\) be a oriented surface (2-dimensional real manifold). The
Fukaya category of \(S\) is now well-understood enough that we know
multiple ways of presenting it. The goal of this course is to study
the Fukaya category of \(S\) via multiple presentations, the original
Floer theoretic definition being only one of them. Others include
the theory of &ldquo;gentle algebras&rdquo; (by results of
Haiden-Katzarkov-Kontsevich), and a perspective that views the
Fukaya category of \(S\) as an object in homological algebra
(Dyckerhoff-Kapranov).
</p>

<p>
Thus, although this course will include some Floer theory, it will
not be strictly speaking necessary in order to understand all of the
different approaches to the Fukaya category of a surface. My hope is
that students with different backgrounds in geometry and algebra
will be able to find at least one way of thinking about the Fukaya
category that makes sense to them. Applications of these ideas to
Homological Mirror Symmetry will also be discussed.
</p>

<ul class="org-ul">
<li><b>Prerequisites:</b> Some familiarity with the tools of algebraic
topology is strongly recommended.</li>
</ul>
</div>
</section>

<section id="outline-container-org850f4ce" class="outline-2">
<h2 id="org850f4ce">References</h2>
<div class="outline-text-2" id="text-org850f4ce">
<ul class="org-ul">
<li>DG categories
<ul class="org-ul">
<li><a href="https://ncatlab.org/nlab/files/bondalKaprEnhTRiangCat.pdf">A. I. Bondal and M. M. Kapranov, Enhanced Triangulated Categories</a>.</li>
<li><a href="https://arxiv.org/abs/math/0601185">B. Keller, On differential graded categories</a>.</li>
</ul></li>
<li>\(A_\infty\) categories
<ul class="org-ul">
<li>P. Seidel, Fukaya Categories and Picard-Lefschetz Theory.</li>
<li><a href="https://arxiv.org/abs/math/9910179">B. Keller, Introduction to A-infinity algebras and modules</a>.</li>
<li><a href="https://arxiv.org/abs/1412.1255">G. Faonte, A-infinity functors and homotopy theory of dg-categories</a>.</li>
</ul></li>
</ul>
</div>
</section>

<section id="outline-container-org3ba08bb" class="outline-2">
<h2 id="org3ba08bb">Lecture notes</h2>
<div class="outline-text-2" id="text-org3ba08bb">
<ol class="org-ol">
<li><a href="notes/595fa22-first-lecture.pdf">Motivation for the Fukaya categories of surfaces</a>.</li>
<li><a href="notes/595fa22-dg-categories.pdf">DG categories</a>.</li>
<li><a href="notes/595fa22-a-infinity-categories.pdf">\(A_\infty\) categories</a>.</li>
</ol>
</div>
</section>
</main>
<footer id="postamble" class="status">
This website was made with <a href="http://www.gnu.org/software/emacs/">Emacs</a> <a href="http://orgmode.org">Org-mode</a>. The css stylesheets are taken from <a href="http://orgmode.org/worg">orgmode.org/worg</a> and are licensed under the <a href="http://www.gnu.org/licenses/gpl.html">GNU General Public License v3</a> or later.
</footer>
</body>
</html>
